app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'admin@hou.edu.vn'
 LIMIT 1
---
    public function login()
    {
        $request = service('request');
        $input = $request->getJSON(true); // Lấy JSON từ JS gửi lên

        // Fallback nếu JS gửi dạng form-data hoặc raw
        $data = $input['data'] ?? $request->getPost('data');

        $email = $data['email'] ?? '';
        $password = $data['password'] ?? '';

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();