app/Controllers/Student.php

    public function list()
    {
        $keyword = $this->request->getGet('keyword');

        $builder = $this->db->table('students');
        $builder->select('students.*, users.email, student_classes.name as class_name');
        $builder->join('users', 'students.user_id = users.id');
        $builder->join('student_classes', 'students.student_class_id = student_classes.id', 'left'); // Join trái vì có thể chưa có lớp

        if ($keyword) {
            $builder->groupStart()
                ->like('students.student_code', $keyword)
                ->orLike('students.name', $keyword)
            ->groupEnd();
        }
        $builder->orderBy('students.id', 'DESC');

        $data = $builder->get()->getResultArray();
---
SELECT `students`.*, `users`.`email`
FROM `students`
LEFT JOIN `users` ON `students`.`user_id` = `users`.`id`
ORDER BY `students`.`id` DESC