app/Models/UserModel.php

SELECT `roles`.`name`
FROM `roles`
JOIN `role_user` ON `roles`.`id` = `role_user`.`role_id`
WHERE `role_user`.`user_id` = '1'
---
    public function getUserRole($userId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('roles');
        $builder->select('roles.name');
        $builder->join('role_user', 'roles.id = role_user.role_id');
        $builder->where('role_user.user_id', $userId);
        $query = $builder->get();